# 03 - Deleting & handling missing values - Wine

### Step 1. Import the necessary libraries

In [22]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data).

### Step 3. Assign it to a variable called wine

In [66]:
wine = pd.read_csv("data/wine.data")
wine

,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
172,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
173,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
174,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
175,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
176,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

### Step 4. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [67]:
wine = wine.drop(wine.columns[[0, 3, 6, 8, 10, 12, 13]], axis='columns')
wine

     14.23  1.71  15.6  127  3.06  2.29  1.04
0    13.20  1.78  11.2  100  2.76  1.28  1.05
1    13.16  2.36  18.6  101  3.24  2.81  1.03
2    14.37  1.95  16.8  113  3.49  2.18  0.86
3    13.24  2.59  21.0  118  2.69  1.82  1.04
4    14.20  1.76  15.2  112  3.39  1.97  1.05
..     ...   ...   ...  ...   ...   ...   ...
172  13.71  5.65  20.5   95  0.61  1.06  0.64
173  13.40  3.91  23.0  102  0.75  1.41  0.70
174  13.27  4.28  20.0  120  0.69  1.35  0.59
175  13.17  2.59  20.0  120  0.68  1.46  0.60
176  14.13  4.10  24.5   96  0.76  1.35  0.61

[177 rows x 7 columns]

### Step 5. Assign the columns as below:

The attributes are (donated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [68]:
wine = pd.DataFrame(np.vstack([wine.columns, wine]))
wine.columns = ['alcohol', 'malic_acid', 'alcalinity_of_ash', 'magnesium', 'flavanoids', 'proanthocyanins', 'hue']

In [69]:
wine

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,14.23,1.71,15.6,127,3.06,2.29,1.04
1,13.2,1.78,11.2,100.0,2.76,1.28,1.05
2,13.16,2.36,18.6,101.0,3.24,2.81,1.03
3,14.37,1.95,16.8,113.0,3.49,2.18,0.86
4,13.24,2.59,21.0,118.0,2.69,1.82,1.04
...,...,...,...,...,...,...,...
173,13.71,5.65,20.5,95.0,0.61,1.06,0.64
174,13.4,3.91,23.0,102.0,0.75,1.41,0.7
175,13.27,4.28,20.0,120.0,0.69,1.35,0.59
176,13.17,2.59,20.0,120.0,0.68,1.46,0.6
177,14.13,4.1,24.5,96.0,0.76,1.35,0.61

### Step 6. Set the values of the first 3 rows from alcohol as NaN

In [70]:
wine.iloc[:3,:1] = np.nan
wine.isnull().sum()

alcohol              3
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

In [71]:
wine.head()

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,NaN,1.71,15.6,127,3.06,2.29,1.04
1,NaN,1.78,11.2,100.0,2.76,1.28,1.05
2,NaN,2.36,18.6,101.0,3.24,2.81,1.03
3,14.37,1.95,16.8,113.0,3.49,2.18,0.86
4,13.24,2.59,21.0,118.0,2.69,1.82,1.04

### Step 7. Now set the value of the rows 3 and 4 of magnesium as NaN

In [72]:
wine.iloc[3:5,3:4] = np.nan
wine.isnull().sum()

alcohol              3
malic_acid           0
alcalinity_of_ash    0
magnesium            2
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

In [73]:
wine.head()

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue
0,NaN,1.71,15.6,127,3.06,2.29,1.04
1,NaN,1.78,11.2,100.0,2.76,1.28,1.05
2,NaN,2.36,18.6,101.0,3.24,2.81,1.03
3,14.37,1.95,16.8,NaN,3.49,2.18,0.86
4,13.24,2.59,21.0,NaN,2.69,1.82,1.04

### Step 8. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [74]:
wine['alcohol']=wine['alcohol'].fillna(10)

wine.isnull().sum()

alcohol              0
malic_acid           0
alcalinity_of_ash    0
magnesium            2
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

In [75]:
wine['magnesium']=wine['magnesium'].fillna(100)

### Step 9. Count the number of missing values

In [76]:
wine.isnull().sum()

alcohol              0
malic_acid           0
alcalinity_of_ash    0
magnesium            0
flavanoids           0
proanthocyanins      0
hue                  0
dtype: int64

### Step 10.  Create an array of 10 random numbers up until 10

In [80]:
wineran = pd.DataFrame(np.random.randint(0,10, size=10))
wineran

   0
0  2
1  2
2  5
3  9
4  1
5  2
6  6
7  6
8  8
9  4

### Step 11.  Use random numbers you generated as an index and assign NaN value to each of cell.

In [83]:
wine['wineran'] = wine.index 
wine.iloc[:10,:] = np.nan
wine

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue,wineran
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
173,13.71,5.65,20.5,95.0,0.61,1.06,0.64,173.0
174,13.40,3.91,23.0,102.0,0.75,1.41,0.7,174.0
175,13.27,4.28,20.0,120.0,0.69,1.35,0.59,175.0
176,13.17,2.59,20.0,120.0,0.68,1.46,0.6,176.0
177,14.13,4.1,24.5,96.0,0.76,1.35,0.61,177.0

### Step 12.  How many missing values do we have?

In [84]:

wine.isnull().sum()

alcohol              10
malic_acid           10
alcalinity_of_ash    10
magnesium            10
flavanoids           10
proanthocyanins      10
hue                  10
wineran              10
dtype: int64

### Step 13. Delete the rows that contain missing values

In [86]:
wine = wine.dropna()
wine

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue,wineran
10,14.10,2.16,18.0,105.0,3.32,2.38,1.25,10.0
11,14.12,1.48,16.8,95.0,2.43,1.57,1.17,11.0
12,13.75,1.73,16.0,89.0,2.76,1.81,1.15,12.0
13,14.75,1.73,11.4,91.0,3.69,2.81,1.25,13.0
14,14.38,1.87,12.0,102.0,3.64,2.96,1.2,14.0
...,...,...,...,...,...,...,...,...
173,13.71,5.65,20.5,95.0,0.61,1.06,0.64,173.0
174,13.40,3.91,23.0,102.0,0.75,1.41,0.7,174.0
175,13.27,4.28,20.0,120.0,0.69,1.35,0.59,175.0
176,13.17,2.59,20.0,120.0,0.68,1.46,0.6,176.0
177,14.13,4.1,24.5,96.0,0.76,1.35,0.61,177.0

### Step 14. Print only the non-null values in alcohol

In [89]:
non_null_series = pd.isnull(wine['alcohol'])
non_null_series

10     False
11     False
12     False
13     False
14     False
       ...
173    False
174    False
175    False
176    False
177    False
Name: alcohol, Length: 168, dtype: bool

In [90]:
print(wine['alcohol'])

10     14.10
11     14.12
12     13.75
13     14.75
14     14.38
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 168, dtype: float64

### Step 15.  Reset the index, so it starts with 0 again

In [93]:
wine = wine.reset_index(drop=True)
wine.head()

,alcohol,malic_acid,alcalinity_of_ash,magnesium,flavanoids,proanthocyanins,hue,wineran
0,14.10,2.16,18.0,105.0,3.32,2.38,1.25,10.0
1,14.12,1.48,16.8,95.0,2.43,1.57,1.17,11.0
2,13.75,1.73,16.0,89.0,2.76,1.81,1.15,12.0
3,14.75,1.73,11.4,91.0,3.69,2.81,1.25,13.0
4,14.38,1.87,12.0,102.0,3.64,2.96,1.2,14.0